// Джон — хакер. Ему удалось вторгнуться на сервер.
// Его следующая работа - написать n числа(1...n) в памяти сервера. Он сделал это, используя написанный им код вируса..
// К сожалению, поскольку сервер принимает только двоичные числа, а его вирусный код не учитывает проблему, в память записывается только часть чисел..
// Дан номер n, ваша задача посчитать сколько чисел записано в память.
// Примечание, n может быть очень большим, поэтому он будет задан строкой.
// Пример
// для n = "10", вывод должен быть 2.
// 2 количество "1" а также "10" записываются в память.
// для n = "20", вывод должен быть 3.
// 3 количество "1", "10" а также "11" записываются в память.
// для n = "100", вывод должен быть 4.
// 4 количество "1", "10", "11" а также "100" записываются в память.

function incompleteVirus(n) {
    let nArr = n.split('')
    for(let index = 0; index<nArr.length; index++){
        if(nArr[index]>1){
            nArr[index]=1
            for(let newIndex = index; newIndex<nArr.length; newIndex++){
                nArr[newIndex]=1
            }
        }
    }
    console.log(nArr)
    return parseInt(nArr.join(''), 2)
}

console.log(incompleteVirus("20"))
