// Ребенок играет с мячом на n-м этаже высотного здания. Высота этого этажа, час, известен.

// Он бросает мяч из окна. Мяч отскакивает (например) на две трети своей высоты (отскок 0.66).

// Его мать смотрит в окно в 1,5 метрах от земли..

// Сколько раз мать увидит, как мяч проходит перед ее окном (в том числе когда он падает а также подпрыгивая?

// Три условия должны быть выполнены для действительного эксперимента:
// Плавающий параметр "h" в метрах должен быть больше 0
// Плавающий параметр "bounce" должен быть больше 0 и меньше 1
// Плавающий параметр "окно" должен быть меньше h.
// Если все три условия выше выполнены, вернуть положительное целое число, в противном случае вернуть -1.

// Примечание:
// Мяч можно увидеть только в том случае, если высота отскакивающего мяча строго больший чем параметр окна.

function bouncingBall(h,  bounce,  window) {
    let counter = 1;
    if (!(h>0 && bounce>0 && bounce<1 && window<h)){
        return -1;
    }
    h = h*bounce;
    while(h>window){
        counter+=2;
        h = h*bounce;
    }
    return counter
}

console.log(bouncingBall(3.0, 0.66, 1.5))